Revit 2027 API
IFCHybridImport.GetIFCStepIdToElementIdMap Method
 Retrieves the association between the original IFC STEP identifiers and the created or updated Elements.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IDictionary<string, ElementId> GetIFCStepIdToElementIdMap()
Public Function GetIFCStepIdToElementIdMap As IDictionary(Of String, ElementId)
public:
IDictionary<String^, ElementId^>^ GetIFCStepIdToElementIdMap()
member GetIFCStepIdToElementIdMap : unit -> IDictionary<string, ElementId>
Return Value
IDictionary<String, ElementId>
See Also
Reference
IFCHybridImport Class
Autodesk.Revit.DB.IFC Namespace